<template>
  <q-page class="">
    <tabs-conteiner
      :nav_route="false"
      :tabs="false"
      :component_lists="component_lists"
      :current_component="current_component"
    >
      <div class="text-body1 q-px-lg column items-center">
        <div style="max-width: 1200px">
          <q-banner inline-actions class="text-white q-my-md bg-red">
            Cтраница находится на стадии разработки. Ниже описан будущий
            функционал.
          </q-banner>
          <p>
            Страница достижений и рекордов пользователей является центром
            информации о наиболее активных и успешных пользователях сайта. На
            этой странице отображаются достижения и рекорды, полученные
            пользователями в ходе использования сайта.
          </p>
          <p>
            Для каждого пользователя отображается список его достижений и
            рекордов, а также статистика его активности на сайте. Например,
            может быть указано количество опубликованных пользователем записей,
            число комментариев, полученных лайков и другие метрики активности.
            Кроме того, на странице могут быть указаны сравнительные показатели,
            такие как рейтинг пользователя по сравнению с другими пользователями
            сайта или его успехи в конкретных областях активности.
          </p>
          Страница также может содержать графики и диаграммы, которые визуально
          отображают активность пользователей на сайте и их достижения.
          Например, график может показывать количество лайков, которые
          пользователь получил за последний месяц, или диаграмма может показать
          процентное соотношение типов действий, выполненных пользователем на
          сайте.
          <p>
            Страница достижений и рекордов может быть использована как для
            мотивации пользователей на большую активность на сайте, так и для
            создания соревновательной атмосферы между пользователями. Она также
            может быть использована для анализа активности пользователей на
            сайте и выявления тенденций и популярных областей активности на
            сайте.
          </p>
        </div>
      </div>
    </tabs-conteiner>
  </q-page>
</template>

<script setup>
import { useMeta } from "quasar";
import { setBreadscrumbs } from "src/services/Service";
import { ref, onMounted } from "vue";
import TabsConteiner from "src/components/blocks/tabs/TabsConteiner.vue";

const current_component = ref("show");
const meta_title = ref("");
const component_lists = ref([
  {
    name_component: "show", // Имя файла компонента
    title: "Достижения и рекорды пользователей портала Усадьба Мечты", // Заголовок текущего компонента
    //sub_title: "Новости из всех категорий в одном месте",
    text_btn: "Содержимое", // Имя вкладки
    flag: "box-news",
    to: "/news/all-news",
  },
]);

onMounted(async () => {
  meta_title.value = "Достижения и рекорды пользователей портала";
  updateBreadscrumbs("Книга рекордов пользователей");
});

const updateBreadscrumbs = (title) => {
  setBreadscrumbs(
    [
      {
        path: "/news",
        meta: { title: "Новости" },
      },
    ],
    title,
    true
  );
};

useMeta(() => {
  return {
    title: meta_title.value + " : Усадьба Мечты",
  };
});
</script>

<style lang="scss" scoped>
.my-card {
  width: 100%;
  max-width: 250px;
}
</style>
